Product/Production/Gateway/AdminDistribution_10/src/main/resources/xml-resources/web-services/EntityAdministrativeDistribution/wsdl/EntityAdminDist.wsdl

<?xml version="1.0" encoding="utf-8"?>
<!-- This wsdl file is for an XDS.b Document Registry Actor -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
  xmlns:edxlde="urn:oasis:names:tc:emergency:EDXL:DE:1.0"
	xmlns="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:nccommonentity="urn:gov:hhs:fha:nhinc:common:nhinccommonentity"
	targetNamespace="urn:gov:hhs:fha:nhinc:entityadmindistribution"
  xmlns:tns="urn:gov:hhs:fha:nhinc:entityadmindistribution"
	xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
	xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" 
	name="EntityAdministrativeDistribution">
    <documentation>NHIN Administrative Distribution wsdl</documentation>
    <types>
        <xsd:schema>
            <xsd:import namespace="urn:oasis:names:tc:emergency:EDXL:DE:1.0" schemaLocation="../schemas/ebRS/edxl-de.xsd"/>
            <xsd:import namespace="urn:gov:hhs:fha:nhinc:common:nhinccommonentity"  schemaLocation="../schemas/nhinc/common/NhincCommonEntity.xsd"/>
        </xsd:schema>
    </types>
    <message name="SendAlertMessage_Message">
        <documentation>Send Alert Message</documentation>
        <part name="body" element="nccommonentity:RespondingGateway_SendAlertMessage"/>
    </message>
    <portType name="AdministrativeDistribution_PortType">
        <operation name="SendAlertMessage">
            <input message="tns:SendAlertMessage_Message"
		wsaw:Action="urn:gov:hhs:fha:nhinc:entityadmindistribution:SendAlertMessage_Message"/>
        </operation>
    </portType>
    <binding name="AdministrativeDistribution_Binding_Soap12" type="tns:AdministrativeDistribution_PortType">
        <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="SendAlertMessage">
            <soap12:operation soapAction="urn:oasis:names:tc:emergency:EDXL:DE:1.0:SendAlertMessage"/>
            <input>
                <soap12:body use="literal"/>
            </input>
        </operation>
    </binding>
    <service name="AdministrativeDistribution_Service">
        <port name="AdministrativeDistribution_PortType" binding="tns:AdministrativeDistribution_Binding_Soap12">
            <soap12:address location="http://localhost:${HttpDefaultPort}/NhinConnect/AdministrativeDistribution"/>
        </port>
    </service>
</definitions>

